Revit 2027 API
EditorInteraction(EditorInteractionType) Constructor
 Construct the interaction with the specified type.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public EditorInteraction(
	EditorInteractionType interactionType
)
Public Sub New (
	interactionType As EditorInteractionType
)
public:
EditorInteraction(
	EditorInteractionType interactionType
)
new :
        interactionType : EditorInteractionType -> EditorInteraction
Parameters
interactionType EditorInteractionType
See Also
Reference
EditorInteraction Class
EditorInteraction Overload
Autodesk.Revit.UI Namespace